Python 3.13.7 (tags/v3.13.7:bcee1c3, Aug 14 2025, 14:15:11) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

======== RESTART: C:/Users/Admin/OneDrive/Рабочий стол/dungeon/For 3.py ========
=======================
   ЗАБРОШЕННАЯ ШАХТА   
=======================

Как зовут героя?
рома
Добро пожаловать, рома!
Ты стоишь у входа в заброшенную шахту. Оттуда тянет могильным холодом и угольной пылью.

Настройка героя.
Здоровье, сила, ловкость, удача — по одному числу в строке:
100
20
30
4

Характеристики героя:
Здоровье: 100
Сила:     20
Ловкость: 30
Удача:    4

Урон героя:       40.0
Критический урон: 80.0
Запас сил:        14

Что делаешь?
1 - осмотреться
2 - идти вперёд
3 - отдохнуть
4 - постучать по стене
5 - зажечь фонарь
6 - тренировка
6
Вы подходите к старой ржавой вагонетке, набитой камнями.
Шахтёры когда-то проверяли на ней свои кирки. Отличная мишень.

Наносите 6 ударов.
Удар 1: 40.0 урона
Удар 2: 40.0 урона
Удар 3: 80.0 урона — критический!
Удар 4: 40.0 урона
Удар 5: 40.0 урона
Удар 6: 80.0 урона — критический!

Итог: 6 ударов, критических: 2.
Общий урон: 320.0
Средний урон: 53.3

Здоровье: 100  Запас сил: 11

=======================
Удачи во тьме, рома! Она тебе понадобится.
=======================
