Python 3.13.7 (tags/v3.13.7:bcee1c3, Aug 14 2025, 14:15:11) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.
>>> 
========= RESTART: C:/Users/Admin/OneDrive/Рабочий стол/dungeon/If1.py =========
=======================
   ЗАБРОШЕННАЯ ШАХТА   
=======================

Как зовут героя?
влад
Добро пожаловать, влад!
Ты стоишь у входа в заброшенную шахту. Оттуда тянет могильным холодом и угольной пылью.

Настройка героя.
Здоровье, сила, ловкость, удача — по одному числу в строке:
100
2
3
4

Характеристики героя:
Здоровье: 100
Сила:     2
Ловкость: 3
Удача:    4

Урон героя:       13.0
Критический урон: 26.0
Запас сил:        14

Что делаешь?
1 - осмотреться
2 - идти вперёд
3 - отдохнуть
4 - постучать по стене
5 - зажечь фонарь
4
Вы постучали по стене. Звук глухой — за камнем сплошная порода.
>>> 4
4
