Python 3.13.7 (tags/v3.13.7:bcee1c3, Aug 14 2025, 14:15:11) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

========= RESTART: C:/Users/Admin/OneDrive/Рабочий стол/dungeon/If3.py =========
=======================
   ЗАБРОШЕННАЯ ШАХТА   
=======================

Как зовут героя?
Ваня
Добро пожаловать, Ваня!
Ты стоишь у входа в заброшенную шахту. Оттуда тянет могильным холодом и угольной пылью.

Настройка героя.
Здоровье, сила, ловкость, удача — по одному числу в строке:
120
70
50
100

Характеристики героя:
Здоровье: 120
Сила:     70
Ловкость: 50
Удача:    100

Урон героя:       115.0
Критический урон: 230.0
Запас сил:        112

Что делаешь?
1 - осмотреться
2 - идти вперёд
3 - отдохнуть
4 - постучать по стене
5 - зажечь фонарь
4
Вы постучали по стене. Звук глухой — за камнем сплошная порода.

Здоровье: 120  Запас сил: 112

=======================
Удачи во тьме, Ваня! Она тебе понадобится.
=======================
