Python 3.13.7 (tags/v3.13.7:bcee1c3, Aug 14 2025, 14:15:11) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.
>>> 
======= RESTART: C:/Users/Admin/OneDrive/Рабочий стол/dungeon/While02.py =======
=======================
   ЗАБРОШЕННАЯ ШАХТА   
=======================

Как зовут героя?
миша
Добро пожаловать, миша!
Ты стоишь у входа в заброшенную шахту. Оттуда тянет могильным холодом и угольной пылью.

Настройка героя.
Здоровье, сила, ловкость, удача — по одному числу в строке:
2
30
40
30

Характеристики героя:
Здоровье: 2
Сила:     30
Ловкость: 40
Удача:    30

Урон героя:       55.0
Критический урон: 110.0
Запас сил:        30

Что делаешь?
1 - осмотреться
2 - идти вперёд
3 - отдохнуть
4 - постучать по стене
5 - зажечь фонарь
6 - тренировка
0 - выйти из подземелья
0
Вы разворачиваетесь и поднимаетесь обратно к свету. Шахта остаётся позади.
